tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Typeface made for developers
cask "font-jetbrains-mono"
# Worship presentation software
cask "openlp"
